<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="samples" type="Parameter" version="opset1">
			<data shape="1,3,512,512" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="input">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="__module.transformer/aten::zeros_like/Constant_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="2" name="__module.transformer/aten::zeros_like/Constant" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="3" name="__module.transformer/aten::zeros_like/ShapeOf" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="2" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.transformer/aten::zeros_like/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1805,tensor.13">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.transformer/aten::unsqueeze/Unsqueeze_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="100, 1, 256" offset="14" size="51200" />
			<output>
				<port id="0" precision="FP16" names="1801,1803,query_embed.5">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.transformer/aten::unsqueeze/Unsqueeze" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module.transformer.decoder.layers.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2462,query.13">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.transformer.decoder.layers.0.self_attn/prim::ListUnpack/VariadicSplit.0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256" offset="51214" size="131072" />
			<output>
				<port id="0" precision="FP16" names="2483,w_q.13">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.transformer.decoder.layers.0.self_attn/prim::ListUnpack/VariadicSplit.0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.transformer.decoder.layers.0.self_attn/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_168879_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="182286" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_168879" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.transformer.decoder.layers.0.self_attn/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2490,q.37">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_174699" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="182798" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.transformer.decoder.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2496">
					<dim>100</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.transformer.decoder.layers.0.self_attn/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="182822" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.transformer.decoder.layers.0.self_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2497,q.39">
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_174700" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="182834" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.transformer.decoder.layers.0.self_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2512,q.41">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module.transformer.decoder.layers.0.self_attn/prim::ListUnpack/VariadicSplit.1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256" offset="182866" size="131072" />
			<output>
				<port id="0" precision="FP16" names="2484,w_k.13">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.transformer.decoder.layers.0.self_attn/prim::ListUnpack/VariadicSplit.1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="__module.transformer.decoder.layers.0.self_attn/aten::linear/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_168880_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="313938" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_168880" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.transformer.decoder.layers.0.self_attn/aten::linear/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2491,k.37">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_174701" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="182798" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.transformer.decoder.layers.0.self_attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2502">
					<dim>100</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.transformer.decoder.layers.0.self_attn/aten::transpose/ScatterElementsUpdate_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="182822" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.transformer.decoder.layers.0.self_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2503,k.39">
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_174702" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="182834" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.transformer.decoder.layers.0.self_attn/aten::view/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2514,k.41">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.transformer.decoder.layers.0.self_attn/prim::ListUnpack/VariadicSplit.2_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256" offset="314450" size="131072" />
			<output>
				<port id="0" precision="FP16" names="2485,w_v.13">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.transformer.decoder.layers.0.self_attn/prim::ListUnpack/VariadicSplit.2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.transformer.decoder.layers.0.self_attn/aten::linear/MatMul_2" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_168881_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="445522" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_168881" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.transformer.decoder.layers.0.self_attn/aten::linear/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2492,v.37">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_174703" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="182798" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.transformer.decoder.layers.0.self_attn/aten::view/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2508">
					<dim>100</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.transformer.decoder.layers.0.self_attn/aten::transpose/ScatterElementsUpdate_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="182822" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.transformer.decoder.layers.0.self_attn/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2509,v.39">
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_174704" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="182834" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.transformer.decoder.layers.0.self_attn/aten::view/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2516,v.41">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="SimpleGPU" type="SimpleGPU" version="extension">
			<data causal="false" queryLen="100" kvSeqLen="100" batchSize="1" hasMask="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="2517,attn_output.37">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_9476" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="446034" size="32" />
			<output>
				<port id="0" precision="I64" names="2518">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.transformer.decoder.layers.0.self_attn/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2519">
					<dim>100</dim>
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_178781" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="446066" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="ShapeOf_178777" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="446074" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_178778" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="446066" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_178779" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="446090" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="51" name="Gather_178780" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Concat_178782" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.transformer.decoder.layers.0.self_attn/aten::view/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2524,attn_output.39">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="self.transformer.decoder.layers.0.self_attn.out_proj.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256" offset="446098" size="131072" />
			<output>
				<port id="0" precision="FP16" names="self.transformer.decoder.layers.0.self_attn.out_proj.weight">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="self.transformer.decoder.layers.0.self_attn.out_proj.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.transformer.decoder.layers.0.self_attn/aten::linear/MatMul_3" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_168882_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 256" offset="577170" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_168882" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.transformer.decoder.layers.0.self_attn/aten::linear/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2525,attn_output.41">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_174705" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="577682" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.transformer.decoder.layers.0.self_attn/aten::view/Reshape_7" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2528,input.299">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.transformer.decoder.layers.0/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2530,input.301">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.transformer.decoder.layers.0.norm1/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="577706" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.transformer.decoder.layers.0.norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_168883_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="577710" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_168883" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.transformer.decoder.layers.0.norm1/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_168884_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="578222" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_168884" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="__module.transformer.decoder.layers.0.norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2534,tensor.15">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="__module.transformer.decoder.layers.0/aten::add/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2535,query.15">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.transformer.decoder.layers.0.multihead_attn/prim::ListUnpack/VariadicSplit.0_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="256, 256" offset="578734" size="131072" />
			<output>
				<port id="0" precision="FP16" names="2559,w_q.15">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.transformer.decoder.layers.0.multihead_attn/prim::ListUnpack/VariadicSplit.0" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.transformer.decoder.layers.0.multihead_attn/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_168885_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 256" offset="709806" size="512" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_168885" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.transformer.decoder.layers.0.multihead_attn/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2566,q.43">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_174706" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="182798" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.transformer.decoder.layers.0.multihead_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2572">
					<dim>100</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.transformer.decoder.layers.0.multihead_attn/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="182822" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.transformer.decoder.layers.0.multihead_attn/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2573,q.45">
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_174707" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="182834" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.transformer.decoder.layers.0.multihead_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="2598,q.47">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="69" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="446090" size="8" />
			<output>
				<port id="0" precision="I64" names="69" />
			</output>
		</layer>
		<layer id="85" name="prim::ListUnpack/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="11,31,51,71,img,img.1,img.3,img.5">
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Unsqueeze_40889" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="446090" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="ShapeOf_174563" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_174564" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="710318" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="89" name="Constant_174565" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="446090" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="90" name="Gather_174566" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="53,79" />
			</output>
		</layer>
		<layer id="91" name="Constant_178013" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="446066" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Reshape_174572" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Convert_174573" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="62">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="aten::max/Range" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="710326" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="aten::max/ReduceMax" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="63" />
			</output>
		</layer>
		<layer id="96" name="aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I64" names="68,s1" />
			</output>
		</layer>
		<layer id="97" name="aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="89,90,91" />
			</output>
		</layer>
		<layer id="98" name="Constant_40269" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="710326" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="99" name="Unsqueeze_40271" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_174580" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="710330" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="101" name="Constant_174581" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="446090" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="102" name="Gather_174582" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="33,76" />
			</output>
		</layer>
		<layer id="103" name="Constant_178014" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="446066" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Reshape_174588" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Convert_174589" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="42">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="aten::max/Range_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="710326" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="aten::max/ReduceMax_1" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="43" />
			</output>
		</layer>
		<layer id="108" name="aten::to/Convert_3" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I64" names="48,s1.3" />
			</output>
		</layer>
		<layer id="109" name="aten::sub/Subtract_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="85,86,87" />
			</output>
		</layer>
		<layer id="110" name="Unsqueeze_40273" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_174596" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="446090" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="112" name="Constant_174597" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="446090" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="113" name="Gather_174598" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="13,73" />
			</output>
		</layer>
		<layer id="114" name="Constant_178015" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="446066" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Reshape_174604" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Convert_174605" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="22">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="aten::max/Range_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="710326" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="aten::max/ReduceMax_2" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="23" />
			</output>
		</layer>
		<layer id="119" name="aten::to/Convert_5" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32" />
			</input>
			<output>
				<port id="1" precision="I64" names="28,s1.1" />
			</output>
		</layer>
		<layer id="120" name="aten::sub/Subtract_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="82,83" />
			</output>
		</layer>
		<layer id="121" name="Constant_40888" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="710326" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="122" name="Unsqueeze_40894" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Concat_40895" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
				<port id="5" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="I64">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="aten::pad/Range" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="710338" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_40904" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="710326" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="126" name="aten::pad/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>6</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="aten::pad/Range_4" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="710350" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_40922" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="710326" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="129" name="aten::pad/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>6</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="aten::pad/ConvertLike_11_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
