<?xml version="1.0"?>
<net name="runtime_gpu_graph" version="11">
	<layers>
		<layer id="0" name="samples" type="Input">
			<data shape="1,3,512,512" element_type="f32" execOrder="0" execTimeMcs="not_executed" originalLayersNames="samples" outputLayouts="bfyx" outputPrecisions="f32" primitiveType="wait_for_events__f32" runtimePrecision="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Convert_41878" type="Reorder">
			<data execOrder="372" execTimeMcs="not_executed" originalLayersNames="Convert_41878" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="reorder_data_fast_b1__f32" runtimePrecision="f32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="__module.backbone.0.body.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="373" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.bn1/aten::mul/Multiply_1,__module.backbone.0.body.bn1/aten::add/Add,__module.backbone.0.body.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="__module.backbone.0.body.maxpool/aten::max_pool2d/MaxPool" type="Pooling">
			<data execOrder="374" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.maxpool/aten::max_pool2d/MaxPool" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.backbone.0.body.layer1.0.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="376" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer1.0.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer1.0.bn1/aten::add/Add,__module.backbone.0.body.layer1.0.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.backbone.0.body.layer1.0.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="377" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer1.0.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer1.0.bn2/aten::add/Add,__module.backbone.0.body.layer1.0.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.backbone.0.body.layer1.0.downsample.1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="375" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer1.0.downsample.1/aten::mul/Multiply_1,__module.backbone.0.body.layer1.0.downsample.1/aten::add/Add" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="__module.backbone.0.body.layer1.0.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="379" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer1.0.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer1.0.bn3/aten::add/Add,__module.backbone.0.body.layer1.0/aten::add_/Add,__module.backbone.0.body.layer1.0.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.backbone.0.body.layer1.1.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="380" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer1.1.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer1.1.bn1/aten::add/Add,__module.backbone.0.body.layer1.1.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.backbone.0.body.layer1.1.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="382" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer1.1.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer1.1.bn2/aten::add/Add,__module.backbone.0.body.layer1.1.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.backbone.0.body.layer1.1.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="383" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer1.1.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer1.1.bn3/aten::add/Add,__module.backbone.0.body.layer1.1/aten::add_/Add,__module.backbone.0.body.layer1.1.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.backbone.0.body.layer1.2.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="385" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer1.2.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer1.2.bn1/aten::add/Add,__module.backbone.0.body.layer1.2.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.backbone.0.body.layer1.2.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="386" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer1.2.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer1.2.bn2/aten::add/Add,__module.backbone.0.body.layer1.2.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.backbone.0.body.layer1.2.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="387" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer1.2.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer1.2.bn3/aten::add/Add,__module.backbone.0.body.layer1.2/aten::add_/Add,__module.backbone.0.body.layer1.2.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.backbone.0.body.layer2.0.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="389" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.0.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer2.0.bn1/aten::add/Add,__module.backbone.0.body.layer2.0.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.backbone.0.body.layer2.0.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="390" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.0.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer2.0.bn2/aten::add/Add,__module.backbone.0.body.layer2.0.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.backbone.0.body.layer2.0.downsample.1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="388" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.0.downsample.1/aten::mul/Multiply_1,__module.backbone.0.body.layer2.0.downsample.1/aten::add/Add" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.backbone.0.body.layer2.0.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="391" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.0.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer2.0.bn3/aten::add/Add,__module.backbone.0.body.layer2.0/aten::add_/Add,__module.backbone.0.body.layer2.0.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module.backbone.0.body.layer2.1.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="392" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.1.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer2.1.bn1/aten::add/Add,__module.backbone.0.body.layer2.1.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.backbone.0.body.layer2.1.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="393" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.1.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer2.1.bn2/aten::add/Add,__module.backbone.0.body.layer2.1.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="__module.backbone.0.body.layer2.1.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="394" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.1.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer2.1.bn3/aten::add/Add,__module.backbone.0.body.layer2.1/aten::add_/Add,__module.backbone.0.body.layer2.1.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.backbone.0.body.layer2.2.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="395" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.2.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer2.2.bn1/aten::add/Add,__module.backbone.0.body.layer2.2.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="__module.backbone.0.body.layer2.2.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="396" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.2.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer2.2.bn2/aten::add/Add,__module.backbone.0.body.layer2.2.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.backbone.0.body.layer2.2.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="397" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.2.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer2.2.bn3/aten::add/Add,__module.backbone.0.body.layer2.2/aten::add_/Add,__module.backbone.0.body.layer2.2.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.backbone.0.body.layer2.3.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="398" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.3.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer2.3.bn1/aten::add/Add,__module.backbone.0.body.layer2.3.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.backbone.0.body.layer2.3.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="399" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.3.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer2.3.bn2/aten::add/Add,__module.backbone.0.body.layer2.3.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.backbone.0.body.layer2.3.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="400" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer2.3.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer2.3.bn3/aten::add/Add,__module.backbone.0.body.layer2.3/aten::add_/Add,__module.backbone.0.body.layer2.3.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.backbone.0.body.layer3.0.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="402" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.0.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer3.0.bn1/aten::add/Add,__module.backbone.0.body.layer3.0.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.backbone.0.body.layer3.0.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="403" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.0.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer3.0.bn2/aten::add/Add,__module.backbone.0.body.layer3.0.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.backbone.0.body.layer3.0.downsample.1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="401" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.0.downsample.1/aten::mul/Multiply_1,__module.backbone.0.body.layer3.0.downsample.1/aten::add/Add" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>64</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.backbone.0.body.layer3.0.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="404" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.0.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer3.0.bn3/aten::add/Add,__module.backbone.0.body.layer3.0/aten::add_/Add,__module.backbone.0.body.layer3.0.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.backbone.0.body.layer3.1.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="405" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.1.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer3.1.bn1/aten::add/Add,__module.backbone.0.body.layer3.1.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.backbone.0.body.layer3.1.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="406" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.1.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer3.1.bn2/aten::add/Add,__module.backbone.0.body.layer3.1.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.backbone.0.body.layer3.1.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="407" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.1.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer3.1.bn3/aten::add/Add,__module.backbone.0.body.layer3.1/aten::add_/Add,__module.backbone.0.body.layer3.1.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.backbone.0.body.layer3.2.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="408" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.2.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer3.2.bn1/aten::add/Add,__module.backbone.0.body.layer3.2.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.backbone.0.body.layer3.2.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="409" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.2.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer3.2.bn2/aten::add/Add,__module.backbone.0.body.layer3.2.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.backbone.0.body.layer3.2.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="410" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.2.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer3.2.bn3/aten::add/Add,__module.backbone.0.body.layer3.2/aten::add_/Add,__module.backbone.0.body.layer3.2.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.backbone.0.body.layer3.3.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="411" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.3.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer3.3.bn1/aten::add/Add,__module.backbone.0.body.layer3.3.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.backbone.0.body.layer3.3.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="412" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.3.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer3.3.bn2/aten::add/Add,__module.backbone.0.body.layer3.3.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.backbone.0.body.layer3.3.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="413" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.3.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer3.3.bn3/aten::add/Add,__module.backbone.0.body.layer3.3/aten::add_/Add,__module.backbone.0.body.layer3.3.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.backbone.0.body.layer3.4.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="414" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.4.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer3.4.bn1/aten::add/Add,__module.backbone.0.body.layer3.4.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.backbone.0.body.layer3.4.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="415" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.4.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer3.4.bn2/aten::add/Add,__module.backbone.0.body.layer3.4.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.backbone.0.body.layer3.4.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="416" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.4.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer3.4.bn3/aten::add/Add,__module.backbone.0.body.layer3.4/aten::add_/Add,__module.backbone.0.body.layer3.4.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.backbone.0.body.layer3.5.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="417" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.5.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer3.5.bn1/aten::add/Add,__module.backbone.0.body.layer3.5.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.backbone.0.body.layer3.5.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="418" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.5.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer3.5.bn2/aten::add/Add,__module.backbone.0.body.layer3.5.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.backbone.0.body.layer3.5.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="419" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer3.5.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer3.5.bn3/aten::add/Add,__module.backbone.0.body.layer3.5/aten::add_/Add,__module.backbone.0.body.layer3.5.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.backbone.0.body.layer4.0.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="421" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer4.0.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer4.0.bn1/aten::add/Add,__module.backbone.0.body.layer4.0.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.backbone.0.body.layer4.0.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="422" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer4.0.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer4.0.bn2/aten::add/Add,__module.backbone.0.body.layer4.0.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.backbone.0.body.layer4.0.downsample.1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="420" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer4.0.downsample.1/aten::mul/Multiply_1,__module.backbone.0.body.layer4.0.downsample.1/aten::add/Add" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>32</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.backbone.0.body.layer4.0.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="423" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer4.0.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer4.0.bn3/aten::add/Add,__module.backbone.0.body.layer4.0/aten::add_/Add,__module.backbone.0.body.layer4.0.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.backbone.0.body.layer4.1.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="424" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer4.1.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer4.1.bn1/aten::add/Add,__module.backbone.0.body.layer4.1.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="__module.backbone.0.body.layer4.1.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="425" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer4.1.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer4.1.bn2/aten::add/Add,__module.backbone.0.body.layer4.1.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.backbone.0.body.layer4.1.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="426" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer4.1.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer4.1.bn3/aten::add/Add,__module.backbone.0.body.layer4.1/aten::add_/Add,__module.backbone.0.body.layer4.1.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.backbone.0.body.layer4.2.bn1/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="427" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer4.2.bn1/aten::mul/Multiply_1,__module.backbone.0.body.layer4.2.bn1/aten::add/Add,__module.backbone.0.body.layer4.2.relu/aten::relu_/Relu" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.backbone.0.body.layer4.2.bn2/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="428" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer4.2.bn2/aten::mul/Multiply_1,__module.backbone.0.body.layer4.2.bn2/aten::add/Add,__module.backbone.0.body.layer4.2.relu/aten::relu_/Relu_1" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.backbone.0.body.layer4.2.bn3/aten::mul/Multiply_1" type="Convolution">
			<data execOrder="429" execTimeMcs="not_executed" originalLayersNames="__module.backbone.0.body.layer4.2.bn3/aten::mul/Multiply_1,__module.backbone.0.body.layer4.2.bn3/aten::add/Add,__module.backbone.0.body.layer4.2/aten::add_/Add,__module.backbone.0.body.layer4.2.relu/aten::relu_/Relu_2" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>512</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.input_proj/aten::_convolution/Convolution" type="Convolution">
			<data execOrder="430" execTimeMcs="not_executed" originalLayersNames="__module.input_proj/aten::_convolution/Convolution,__module.input_proj/aten::_convolution/Add" outputLayouts="b_fs_yx_fsv16" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2048</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="__module.transformer/aten::flatten/Reshape_reorder" type="Reorder">
			<data execOrder="431" execTimeMcs="not_executed" originalLayersNames="__module.transformer/aten::flatten/Reshape" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="jit:ir__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.transformer/aten::flatten/Reshape" type="Reshape">
			<data execOrder="432" execTimeMcs="not_executed" originalLayersNames="__module.transformer/aten::flatten/Reshape" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="undef" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.transformer/aten::permute/Transpose" type="Permute">
			<data execOrder="433" execTimeMcs="not_executed" originalLayersNames="__module.transformer/aten::permute/Transpose" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="permute_ref__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>256</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>256</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.transformer.encoder.layers.0/aten::add/Add" type="Eltwise">
			<data execOrder="435" execTimeMcs="not_executed" originalLayersNames="__module.transformer.encoder.layers.0/aten::add/Add" outputLayouts="bfyx" outputPrecisions="f16" primitiveType="eltwise_simple_vload8__f16" runtimePrecision="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>256</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>256</dim>
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
