<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="5" name="q" type="Parameter" version="opset1">
			<data shape="1,8,100,32" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="q">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="k" type="Parameter" version="opset1">
			<data shape="1,8,100,32" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="k">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="v" type="Parameter" version="opset1">
			<data shape="1,8,100,32" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="v">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="q_1" type="Parameter" version="opset1">
			<data shape="1,8,100,32" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="q_1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="k_1" type="Parameter" version="opset1">
			<data shape="1,8,100,32" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="k_1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="v_1" type="Parameter" version="opset1">
			<data shape="1,8,100,32" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="v_1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="q_add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="k_add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="v_add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="SimpleGPU" type="SimpleGPU" version="extension">
			<data causal="false" queryLen="100" kvSeqLen="100" batchSize="1" hasMask="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="sdpa" type="ScaledDotProductAttention" version="opset13">
			<data causal="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="output" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</input>
		</layer>
		<layer id="10" name="output1" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>100</dim>
					<dim>32</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="1" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="2" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="8" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="6" from-port="2" to-layer="11" to-port="0" />
		<edge from-layer="7" from-port="2" to-layer="9" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="11" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="2" />
		<edge from-layer="8" from-port="2" to-layer="11" to-port="2" />
		<edge from-layer="9" from-port="3" to-layer="10" to-port="0" />
		<edge from-layer="11" from-port="3" to-layer="12" to-port="0" />
	</edges>
	<rt_info />
</net>
